### Terraform `plan` Succeeded for Workspace: `default`
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-   destroy

Terraform will perform the following actions:

  # kubernetes_secret.onp_minecraft_one_day_to_reset_secrets["seichi-debug-minecraft"] will be destroyed
  # (because kubernetes_secret.onp_minecraft_one_day_to_reset_secrets is not in configuration)
-   resource "kubernetes_secret" "onp_minecraft_one_day_to_reset_secrets" {
-       data      = (sensitive value)
-       id        = "seichi-debug-minecraft/mcserver--one-day-to-reset--config-secrets" -> null
-       immutable = false -> null
-       type      = "Opaque" -> null

-       metadata {
-           annotations      = {} -> null
-           generation       = 0 -> null
-           labels           = {} -> null
-           name             = "mcserver--one-day-to-reset--config-secrets" -> null
-           namespace        = "seichi-debug-minecraft" -> null
-           resource_version = "5124524" -> null
-           uid              = "140bb740-e24d-40d3-a726-ec5d6f6ed776" -> null
        }
    }

  # kubernetes_secret.onp_minecraft_one_day_to_reset_secrets["seichi-minecraft"] will be destroyed
  # (because kubernetes_secret.onp_minecraft_one_day_to_reset_secrets is not in configuration)
-   resource "kubernetes_secret" "onp_minecraft_one_day_to_reset_secrets" {
-       data      = (sensitive value)
-       id        = "seichi-minecraft/mcserver--one-day-to-reset--config-secrets" -> null
-       immutable = false -> null
-       type      = "Opaque" -> null

-       metadata {
-           annotations      = {} -> null
-           generation       = 0 -> null
-           labels           = {} -> null
-           name             = "mcserver--one-day-to-reset--config-secrets" -> null
-           namespace        = "seichi-minecraft" -> null
-           resource_version = "5124523" -> null
-           uid              = "4a083fe4-c5c5-4aa5-a20b-67737dd81340" -> null
        }
    }

  # kubernetes_secret.onp_minecraft_prod_one_day_to_reset_secrets will be created
+   resource "kubernetes_secret" "onp_minecraft_prod_one_day_to_reset_secrets" {
+       data = (sensitive value)
+       id   = (known after apply)
+       type = "Opaque"

+       metadata {
+           generation       = (known after apply)
+           name             = "mcserver--one-day-to-reset--config-secrets"
+           namespace        = "seichi-minecraft"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 2 to destroy.
```
</details>